import 'package:norea_school_student/data/models/recitation.dart';

final recData = <Recitation>[
  Recitation.auto("اسم الآنسة المسمعة1", "2023-4-1", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 85, 4, 13),
  Recitation.auto("اسم الآنسة المسمعة2", "2023-3-27", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 65, 2, 19),
  Recitation.auto("اسم الآنسة المسمعة3", "2023-3-26", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 90, 3, 15),
  Recitation.auto("اسم الآنسة المسمعة4", "2023-3-25", "صحيح مسلم", 2, [20, 21, 22, 23, 24, 25, 26], 56, 2, 21),
  Recitation.auto("اسم الآنسة المسمعة5", "2023-3-24", "صحيح مسلم", 2, [15, 16, 17, 18, 19], 55, 4, 12),
  Recitation.auto("اسم الآنسة المسمعة6", "2023-3-23", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 40, 3, 13),
  Recitation.auto("اسم الآنسة المسمعة7", "2023-3-21", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 60, 4, 12),
  Recitation.auto("اسم الآنسة المسمعة8", "2023-3-19", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 60, 3, 14),
  Recitation.auto("اسم الآنسة المسمعة9", "2023-3-18", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 75, 2, 13),
  Recitation.auto("اسم الآنسة المسمعة10", "2023-3-17", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 65, 3, 12),
  Recitation.auto("اسم الآنسة المسمعة11", "2023-3-16", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 60, 4, 16),
  Recitation.auto("اسم الآنسة المسمعة12", "2023-3-15", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 80, 3, 18),
  Recitation.auto("اسم الآنسة المسمعة13", "2023-3-15", "صحيح مسلم", 2, [10, 11, 12, 13, 14], 70, 5, 29),
  Recitation.auto("اسم الآنسة المسمعة14", "2023-2-29", "صحيح مسلم", 2, [27, 28, 29, 30, 31, 32], 80, 5, 14),
  Recitation.auto("اسم الآنسة المسمعة15", "2023-2-28", "صحيح مسلم", 2, [33, 34, 35, 36, 37], 90, 3, 15),
];
